[
    {
        "id": 1,
        "title": "EDC-SICIP-EWU Hosts Successful Industry Partnership Summit 2025",
        "date": "2025-03-15",
        "hero_image": "/Resources/images/News/news1.jpg",
        "gallery": [
            "/Resources/images/herobg/herobg1.jpg",
            "/Resources/images/herobg/herobg2.jpg",
            "/Resources/images/herobg/herobg3.jpg"
        ],
        "content": "<p>The East West University in collaboration with SICIP successfully organized the Industry Partnership Summit 2025, bringing together key stakeholders from the leather, leather goods, and footwear industry. The event marked a significant milestone in strengthening the bond between academia and industry.</p><p>The summit featured keynote speeches from prominent industry leaders, interactive panel discussions, and networking sessions. Over 150 participants, including industry professionals, educators, and students, attended the event held at the EWU campus.</p><p>Dr. M.M. Shahidul Hassan, Vice Chancellor of East West University, emphasized the importance of such collaborations in producing industry-ready graduates. 'This partnership will create pathways for our students to gain practical knowledge and hands-on experience in the leather industry,' he stated.</p><p>The event concluded with the signing of several MoUs between EDC-SICIP and leading leather manufacturing companies, paving the way for enhanced internship opportunities and curriculum development aligned with industry needs.</p>"
    },
    {
        "id": 2,
        "title": "Graduate Diploma Program Batch-7 Achieves 100% Placement Success",
        "date": "2025-02-28",
        "hero_image": "/Resources/images/CelebrationCeremony/celebration1.jpg",
        "gallery": [
            "/Resources/images/CelebrationCeremony/celebration1.jpg",
            "/Resources/images/CelebrationCeremony/celebration2.jpg",
            "/Resources/images/CelebrationCeremony/celebration3.jpg",
            "/Resources/images/CelebrationCeremony/celebration4.jpg"
        ],
        "content": "<p>In a remarkable achievement, all graduates from Batch-7 of the Graduate Diploma in Leather, Leather Goods & Footwear Management have secured employment within three months of course completion. This unprecedented success rate demonstrates the program's effectiveness in preparing students for industry demands.</p><p>The graduates have been placed in leading organizations across Bangladesh, including prominent leather manufacturing companies, footwear brands, and export houses. Many have secured positions in quality control, production management, and design departments.</p><p>Program Coordinator Mr. Rahman stated, 'This achievement reflects our commitment to providing industry-relevant education and strong placement support. We work closely with our industry partners to ensure our curriculum meets market requirements.'</p><p>Several graduates shared their success stories, highlighting how the practical training, industry visits, and internship opportunities during the program helped them transition smoothly into professional roles. The program continues to accept applications for Batch-9, with increased interest from aspiring professionals.</p>"
    },
    {
        "id": 3,
        "title": "International Workshop on Sustainable Leather Production Concludes",
        "date": "2025-01-20",
        "hero_image": "/Resources/images/FGD/fgd1.jpg",
        "gallery": [
            "/Resources/images/FGD/fgd1.jpg",
            "/Resources/images/FGD/fgd2.jpg",
            "/Resources/images/FGD/fgd3.jpg"
        ],
        "content": "<p>EDC-SICIP-EWU successfully concluded a three-day international workshop on Sustainable Leather Production, featuring experts from Germany, Italy, and India. The workshop focused on environmentally friendly tanning processes, waste management, and sustainable practices in the leather industry.</p><p>International consultant Dr. Hans Mueller from Germany shared insights on chrome-free tanning technologies and their implementation in European markets. Italian designer Maria Rossi conducted sessions on sustainable design principles for leather goods that appeal to eco-conscious consumers.</p><p>The workshop included hands-on training sessions where participants learned about innovative water treatment methods, vegetable tanning techniques, and energy-efficient production processes. Over 80 professionals from various leather manufacturing companies participated in the program.</p><p>Participants received certificates and comprehensive resource materials. The workshop emphasized the importance of adopting sustainable practices to remain competitive in international markets, where environmental compliance is increasingly becoming a prerequisite for business.</p><p>EDC-SICIP-EWU announced plans to conduct follow-up training sessions and establish a sustainability resource center to support the industry's transition toward greener production methods.</p>"
    },
    {
        "id": 4,
        "title": "EDC-SICIP Signs MoU with Leading European Footwear Brands",
        "date": "2024-12-10",
        "hero_image": "/Resources/images/SigningCeremony/signing3.jpg",
        "gallery": [
            "/Resources/images/SigningCeremony/signing3.jpg",
            "/Resources/images/SigningCeremony/signing4.jpg"
        ],
        "content": "<p>In a significant development for Bangladesh's leather industry, EDC-SICIP-EWU signed Memorandums of Understanding with three major European footwear brands during a ceremony held at the EWU campus. This partnership opens new avenues for skill development, technology transfer, and market access for local manufacturers.</p><p>The MoUs establish frameworks for collaborative research, faculty exchange programs, and student internships in European facilities. The partner brands will also provide technical expertise in quality standards, design innovation, and production efficiency.</p><p>Mr. Karim, Project Director of EDC-SICIP, highlighted that these partnerships will help Bangladeshi manufacturers meet international quality standards and access premium market segments. 'This is a game-changing opportunity for our leather industry to move up the value chain,' he remarked.</p><p>The European partners expressed confidence in Bangladesh's skilled workforce and manufacturing capabilities. They emphasized their commitment to supporting local capacity building through training programs and technology transfer initiatives.</p>"
    },
    {
        "id": 5,
        "title": "New State-of-the-Art Training Facility Inaugurated at EWU Campus",
        "date": "2024-11-05",
        "hero_image": "/Resources/images/Carousel/carousel1.jpg",
        "gallery": [
            "/Resources/images/Carousel/carousel1.jpg",
            "/Resources/images/Carousel/carousel2.jpg",
            "/Resources/images/Carousel/carousel3.jpg"
        ],
        "content": "<p>East West University inaugurated a new state-of-the-art training facility for the EDC-SICIP leather program, equipped with modern machinery, design studios, and quality testing laboratories. The facility represents a significant investment in developing world-class training infrastructure for Bangladesh's leather industry.</p><p>The 15,000 square feet facility includes specialized zones for different aspects of leather production and footwear manufacturing. The design studio features CAD software and digital pattern-making equipment, while the production floor houses industrial sewing machines, lasting machines, and finishing equipment.</p><p>The quality testing laboratory is equipped with instruments for measuring leather strength, color fastness, and chemical composition, enabling students to learn industry-standard testing procedures. A dedicated research wing will support innovation in leather technology and sustainable production methods.</p><p>The inauguration ceremony was attended by government officials, industry leaders, and development partners. The facility will serve not only diploma students but also provide short-term training courses for working professionals in the leather industry.</p><p>This infrastructure development aligns with the government's vision of transforming Bangladesh's leather industry into a high-value, technology-driven sector capable of competing in global markets.</p>"
    }
]