[
    {
        "id": 1,
        "title": "Discussion on establishing industry linkages for internships and job placements",
        "date": "2025-09-25",
        "hero_image": "/Resources/images/InternshipMeeting/1.jpeg",
        "gallery": [
            "/Resources/images/InternshipMeeting/1.jpeg",
            "/Resources/images/InternshipMeeting/2.jpeg",
            "/Resources/images/InternshipMeeting/3.jpeg"
        ],
        "content": "<p>Discussion on establishing industry linkages for internships and job placements: As per the requirement of course curriculum the participants of Batch 3 &amp; Batch 4 who have completed the course work (36 credits out of 42 credits) of the Graduate Diploma in Leather, Leather Goods and Footwear Management (GDLFM) program under SICIP have been placed in Leather and Footwear Industries from September 28, 2025 to December 27, 2025 for Internship. In total, 41 interns are placed in 24 organizations.</p>\n<table border=\"1\" cellpadding=\"8\" cellspacing=\"0\" style=\"border-collapse: collapse; width: 100%;\">\n  <thead style=\"background-color: #f2f2f2;\">\n    <tr>\n      <th>SL.</th>\n      <th>Name of Industry</th>\n      <th>Total Number of Trainee</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr><td>1</td><td>Advanced Manufacturing Group</td><td>1</td></tr>\n    <tr><td>2</td><td>Alliance Leather Goods &amp; Footwear Limited</td><td>4</td></tr>\n    <tr><td>3</td><td>A One Composite Leatherwear (Pvt) Ltd</td><td>1</td></tr>\n    <tr><td>4</td><td>Apex Footwear Limited</td><td>8</td></tr>\n    <tr><td>5</td><td>Apex Tannery Limited</td><td>1</td></tr>\n    <tr><td>6</td><td>Atlas Footwear Limited</td><td>1</td></tr>\n    <tr><td>7</td><td>Bata Shoe Co. (BD) Limited</td><td>1</td></tr>\n    <tr><td>8</td><td>Bay Emporium Ltd.</td><td>2</td></tr>\n    <tr><td>9</td><td>Bay Tanneries Ltd.</td><td>1</td></tr>\n    <tr><td>10</td><td>Classical Leather &amp; Footwear Products Limited</td><td>1</td></tr>\n    <tr><td>11</td><td>Edison Group</td><td>1</td></tr>\n    <tr><td>12</td><td>Footgear Footware Limited</td><td>2</td></tr>\n    <tr><td>13</td><td>Golden Chang Shoes (BD) Ltd</td><td>1</td></tr>\n    <tr><td>14</td><td>Izman Footwear Limited</td><td>4</td></tr>\n    <tr><td>15</td><td>Kyros Footwear Industries Limited</td><td>1</td></tr>\n    <tr><td>16</td><td>Lotto Bangladesh (Express Leather Products Limited)</td><td>1</td></tr>\n    <tr><td>17</td><td>M K Footwear Limited</td><td>1</td></tr>\n    <tr><td>18</td><td>NADIA SHOES PVT LTD.</td><td>1</td></tr>\n    <tr><td>19</td><td>OMC Footwear Ltd</td><td>1</td></tr>\n    <tr><td>20</td><td>Picard Bangladesh Limited</td><td>2</td></tr>\n    <tr><td>21</td><td>Posh Footwear Limited</td><td>1</td></tr>\n    <tr><td>22</td><td>SMART Shoes Limited</td><td>1</td></tr>\n    <tr><td>23</td><td>Step Group of Industry Limited</td><td>2</td></tr>\n    <tr><td>24</td><td>Walkar Footwear Ltd. (RFL Group)</td><td>1</td></tr>\n    <tr style=\"font-weight:bold;\"><td colspan=\"2\">Total Trainees</td><td>41</td></tr>\n  </tbody>\n</table>"
    },
    {
        "id": 2,
        "title": "EDC-EWU-SICIP Holds Orientation Program for Batch 7 & 8 of the Leather, Leather Goods, and Footwear Management Program",
        "date": "2025-09-10",
        "hero_image": "/Resources/images/OrientationBatch_7_8/Orien1.jpg",
        "gallery": [
            "/Resources/images/OrientationBatch_7_8/Orien1.jpg",
            "/Resources/images/OrientationBatch_7_8/Orien2.jpg",
            "/Resources/images/OrientationBatch_7_8/Orien3.jpg"
        ],
        "content": "<p>The Executive Development Center (EDC), a part of the Skills for Industry Competitiveness and Innovation Program (SICIP) at East West University (EWU), hosted an orientation program for the Graduate Diploma in Leather, Leather Goods, and Footwear Management. The event, held on September 10, 2025, at the S. M. Nousher Ali Lecture Gallery, welcomed students from Batch 7 and Batch 8 of the program.</p><p>Professor Dr. Shams Rahman, Vice Chancellor of EWU and Adviser to the EDC, attended as the Chief Guest. In his address, he welcomed the new students to EWU and highlighted the significant potential of the leather and footwear industry. He noted that it is the second-highest export industry in the country and emphasized the critical role of future managers in ensuring product quality. Professor Rahman stressed that a single faulty product could disrupt the entire supply chain, urging students to strive for perfection.</p><p>The program was also graced by two special guests: Ms. Amrita Makin Islam, Deputy Managing Director of Picard Bangladesh Limited, and Dr. Md. Matiur Rahman, Deputy Secretary and Assistant Executive Program Director (Program Management) of SICIP, Ministry of Finance, Government of Bangladesh.</p><p>Professor Dr. Tanbir Ahmed Chowdhury, the Program Director of the Executive Development Center (EDC) and a Professor in the Department of Business Administration, chaired the event. Dr. Mohammad Rezwanul Huq, the Assistant Director of EDC and an Associate Professor in the Department of Computer Science and Engineering at EWU, facilitated the program. Many participants attended the orientation program.</p>"
    },
    
    {
        "id": 3,
        "title": "Stepping into the Future: GDLFM Program Makes Strides at BLF Expo 2025",
        "date": "2025-07-24",
        "hero_image": "/Resources/images/BLF/BLF_8.jpeg",
        "gallery": [
            "/Resources/images/BLF/BLF_10.jpeg",
            "/Resources/images/BLF/BLF_8.jpeg",
            "/Resources/images/BLF/BLF_6.jpeg"
        ],
        "content": "<p>The Executive Development Center (EDC) under the Skills for Industry Competitiveness and Innovation Program (SICIP) at East West University (EWU) actively participated in the 9th International Trade Show – Bangladesh Leather & Footwear Expo (BLF Expo) 2025, held from 24 to 26 July 2025 at the International Convention City Bashundhara (ICCB), Dhaka. The event was organized by LIMRA Trade Fairs & Exhibitions Pvt. Ltd. As one of the premier exhibitions in South Asia for the leather and footwear sector, the BLF Expo 2025 featured cutting-edge technologies and products including advanced shoe-making and leather goods machinery, knitting machines, automation production lines, synthetic leather, chemicals, raw materials, and more. It brought together industry leaders, international exhibitors, local manufacturers, and innovators under one roof. At the expo, EDC-SICIP of East West University showcased its flagship program — the Graduate Diploma in Leather, Leather Goods, and Footwear Management (GDLFM). Informative flyers and the latest admission circular were distributed to a diverse group of visitors, drawing strong interest from industry professionals, aspiring students, and business owners alike. A notable highlight was the participation of several GDLFM trainees, who proudly exhibited their own company products at the expo, demonstrating the program’s practical impact and entrepreneurial spirit. Their involvement underscored the program's commitment to hands-on learning and industry relevance.</p><p>The event served as a strategic platform for EDC-SICIP-EWU to build deeper engagement with the leather and footwear industry. It also laid the groundwork for future collaborations, industry partnerships, and internship opportunities for both current students and alumni of the GDLFM program. By participating in the BLF Expo 2025, East West University reaffirmed its mission to bridge the skills gap in the leather and footwear sector and support Bangladesh’s growth as a competitive hub in global markets.</p>"
    },

    {
        "id": 4,
        "title": "FGD on GDLFM Program: Job Creation and Employment Opportunities",
        "date": "2025-07-19",
        "hero_image": "/Resources/images/FGD/FGD_EDC_EWU_2.jpeg",
        "gallery": [
            "/Resources/images/FGD/FGD_EDC_EWU_2.jpeg",
            "/Resources/images/FGD/FGD_EDC_EWU_1.jpeg",
            "/Resources/images/FGD/FGD_EDC_EWU_5.jpeg"
        ],
        "content": "<p>The Executive Development Center (EDC) at East West University (EWU) organized a Focus Group Discussion (FGD) session titled, ‘FGD on GDLFM Program: Job Creation and Employment Opportunities’, on Saturday, 19 July 2025 at 11.00 am in the Seminar room no. 418 at East West University. This event aimed to strengthen industry-academia collaboration through discussions with senior Human Resource (HR) professionals from leading organizations in the leather, leather goods, and footwear industry. All participants in this session discussed collaborative strategies for internship and placement opportunities, co-creating curriculum and training modules aligned with industry standards, and identifying key skill gaps between graduates and industry needs. It also provided an opportunity to share the perspectives, needs, and expectations of various organizations. HR professionals from Bata Bangladesh Limited, Bay Emporium Limited, FB Footwear Limited, PICARD Bangladesh Limited, Decathlon, Edison Group, RFL Group, Accenture Footwear & Leather Products Limited, Alliance Leathergoods and Footwear Limited, Hamko Leather Limited, Rapida Shoes & Bags Limited, Advance Manufacturing Group (AMG), Good Bags & Accessories Limited and Leatherex Footwear Industries Limited were present during the session as a discussant. Professor Dr. Tanbir Ahmed Chowdhury, Program Director of the EDC at East West University, chaired this program. Deputy Director and Assistant Directors were also present during the session.</p><p>Key Outcomes of the Discussion: Valued discussants agreed that EDC-EWU would share internship student details with companies during placements. EDC will inform the human resource department in advance about the interns, both through the association and individually. HR experts suggested adding new courses, including: Product Development, AutoCAD, Supply Chain, Industrial Behavior, Adaptability in the Workplace, Soft Skills, and Interpersonal Communication Skills.</p>"
    }
]